# Эмулятор машины Тьюринга

Учебный проект: простая реализация машины Тьюринга на Python с консольной визуализацией.

## Структура

- `turing_machine.py` — лента (Tape) и машина (TuringMachine)
- `parser.py` — парсинг переходов из строкового формата
- `visualization.py` — вывод ленты и головки в консоль
- `main.py` — точка входа, пошаговый запуск
- `examples/binary_increment.py` — пример: инкремент двоичного числа

## Как запустить

Из каталога `turing_machine`:

```bash
python3 main.py
```
(или `python main.py`, в зависимости от системы)

Пошаговое выполнение с задержкой между шагами (по умолчанию 0.7 с).

## Формат входных данных (переходы)

Переходы задаются словарём:

```python
{
    'q0 1': 'q1 0 R',
    'q1 #': 'qf 1 N'
}
```

- **Ключ:** `"состояние символ"` — текущее состояние и символ под головкой.
- **Значение:** `"новое_состояние записать направление"` — куда перейти, что записать, куда двигать головку (L / R / N).

Парсер превращает это в внутренний вид:

- `('q0', '1')` → `('q1', '0', 'R')`

## Пример вывода

Старт (инкремент `110` → 7):

```
--- Старт ---
 1   1  [0]  #
        ↑ головка
Состояние: q0

--- Шаг 1 ---
 1  [1]  0   #
      ↑ головка
Состояние: q0
...
--- Финал ---
 1  [1]  1   #
      ↑ головка
Состояние: qf
Выполнено шагов: ...
```

## Пример использования в коде

```python
from turing_machine import Tape, TuringMachine
from parser import parse_transitions

tape = Tape(list("110"))
raw = {'q0 0': 'q0 0 R', 'q0 1': 'q0 1 R', 'q0 #': 'q1 # L', ...}
transitions = parse_transitions(raw)
machine = TuringMachine(transitions, 'q0', 'qf', tape)

while machine.step():
    print(machine.current_state, tape.get_cells())
```

## Требования

Python 3.7+.
